---
kind: other
id: Properties.T:Autodesk.Revit.DB.SketchedStairsCurveData
source: html/b6d46129-7f75-5e61-438d-f18b0c632909.htm
---
# SketchedStairsCurveData Properties

Specifies whether the .NET object represents a valid Revit entity.